arzh_loadTest/get_ack_1.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 10.661ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.411ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.34ms  539.50us   6.06ms   69.05%
    Req/Sec   104.93    108.81   333.00     80.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.32ms
 75.000%    2.69ms
 90.000%    3.03ms
 99.000%    3.69ms
 99.900%    5.05ms
 99.990%    6.07ms
 99.999%    6.07ms
100.000%    6.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.937     0.000000            1         1.00
       1.678     0.100000          390         1.11
       1.882     0.200000          780         1.25
       2.036     0.300000         1170         1.43
       2.187     0.400000         1565         1.67
       2.315     0.500000         1950         2.00
       2.375     0.550000         2146         2.22
       2.449     0.600000         2342         2.50
       2.523     0.650000         2535         2.86
       2.605     0.700000         2733         3.33
       2.691     0.750000         2927         4.00
       2.737     0.775000         3024         4.44
       2.783     0.800000         3123         5.00
       2.835     0.825000         3223         5.71
       2.897     0.850000         3321         6.67
       2.959     0.875000         3415         8.00
       2.997     0.887500         3464         8.89
       3.033     0.900000         3510        10.00
       3.075     0.912500         3560        11.43
       3.113     0.925000         3608        13.33
       3.167     0.937500         3657        16.00
       3.197     0.943750         3681        17.78
       3.225     0.950000         3705        20.00
       3.281     0.956250         3730        22.86
       3.323     0.962500         3754        26.67
       3.379     0.968750         3779        32.00
       3.415     0.971875         3791        35.56
       3.437     0.975000         3803        40.00
       3.469     0.978125         3816        45.71
       3.523     0.981250         3827        53.33
       3.579     0.984375         3840        64.00
       3.607     0.985938         3846        71.11
       3.653     0.987500         3852        80.00
       3.675     0.989062         3858        91.43
       3.711     0.990625         3864       106.67
       3.741     0.992188         3870       128.00
       3.773     0.992969         3873       142.22
       3.787     0.993750         3877       160.00
       3.809     0.994531         3879       182.86
       3.847     0.995313         3882       213.33
       3.913     0.996094         3885       256.00
       3.987     0.996484         3887       284.44
       4.007     0.996875         3888       320.00
       4.051     0.997266         3890       365.71
       4.093     0.997656         3891       426.67
       4.871     0.998047         3893       512.00
       4.943     0.998242         3894       568.89
       4.943     0.998437         3894       640.00
       4.999     0.998633         3895       731.43
       5.051     0.998828         3896       853.33
       5.635     0.999023         3897      1024.00
       5.635     0.999121         3897      1137.78
       5.635     0.999219         3897      1280.00
       5.763     0.999316         3898      1462.86
       5.763     0.999414         3898      1706.67
       5.771     0.999512         3899      2048.00
       5.771     0.999561         3899      2275.56
       5.771     0.999609         3899      2560.00
       5.771     0.999658         3899      2925.71
       5.771     0.999707         3899      3413.33
       6.067     0.999756         3900      4096.00
       6.067     1.000000         3900          inf
#[Mean    =        2.342, StdDeviation   =        0.540]
#[Max     =        6.064, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.05
Transfer/sec:     18.56KB