arzh_loadTest/get_ack_2.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 11.832ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 11.820ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.47ms  520.89us   6.42ms   69.15%
    Req/Sec   104.94    110.12   444.00     81.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.44ms
 75.000%    2.80ms
 90.000%    3.13ms
 99.000%    3.66ms
 99.900%    5.73ms
 99.990%    6.43ms
 99.999%    6.43ms
100.000%    6.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.988     0.000000            1         1.00
       1.834     0.100000          394         1.11
       2.042     0.200000          780         1.25
       2.191     0.300000         1170         1.43
       2.317     0.400000         1562         1.67
       2.437     0.500000         1953         2.00
       2.505     0.550000         2145         2.22
       2.573     0.600000         2342         2.50
       2.641     0.650000         2536         2.86
       2.717     0.700000         2735         3.33
       2.795     0.750000         2926         4.00
       2.839     0.775000         3023         4.44
       2.891     0.800000         3127         5.00
       2.935     0.825000         3219         5.71
       2.999     0.850000         3318         6.67
       3.067     0.875000         3415         8.00
       3.097     0.887500         3462         8.89
       3.127     0.900000         3513        10.00
       3.161     0.912500         3561        11.43
       3.205     0.925000         3608        13.33
       3.249     0.937500         3657        16.00
       3.271     0.943750         3683        17.78
       3.301     0.950000         3708        20.00
       3.337     0.956250         3730        22.86
       3.389     0.962500         3754        26.67
       3.427     0.968750         3779        32.00
       3.443     0.971875         3793        35.56
       3.481     0.975000         3804        40.00
       3.501     0.978125         3815        45.71
       3.523     0.981250         3827        53.33
       3.559     0.984375         3840        64.00
       3.575     0.985938         3846        71.11
       3.619     0.987500         3852        80.00
       3.655     0.989062         3859        91.43
       3.677     0.990625         3864       106.67
       3.713     0.992188         3870       128.00
       3.729     0.992969         3873       142.22
       3.793     0.993750         3876       160.00
       3.813     0.994531         3879       182.86
       3.849     0.995313         3882       213.33
       3.919     0.996094         3885       256.00
       4.519     0.996484         3887       284.44
       4.551     0.996875         3888       320.00
       4.811     0.997266         3890       365.71
       5.031     0.997656         3891       426.67
       5.483     0.998047         3893       512.00
       5.519     0.998242         3894       568.89
       5.519     0.998437         3894       640.00
       5.715     0.998633         3895       731.43
       5.727     0.998828         3896       853.33
       5.779     0.999023         3897      1024.00
       5.779     0.999121         3897      1137.78
       5.779     0.999219         3897      1280.00
       5.783     0.999316         3898      1462.86
       5.783     0.999414         3898      1706.67
       6.099     0.999512         3899      2048.00
       6.099     0.999561         3899      2275.56
       6.099     0.999609         3899      2560.00
       6.099     0.999658         3899      2925.71
       6.099     0.999707         3899      3413.33
       6.427     0.999756         3900      4096.00
       6.427     1.000000         3900          inf
#[Mean    =        2.469, StdDeviation   =        0.521]
#[Max     =        6.424, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.04
Transfer/sec:     18.56KB