arzh_loadTest/put_ack_1.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 10.627ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.592ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.58ms  545.99us   6.72ms   71.05%
    Req/Sec   104.89    110.28   333.00     80.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.57ms
 75.000%    2.92ms
 90.000%    3.22ms
 99.000%    3.84ms
 99.900%    6.19ms
 99.990%    6.73ms
 99.999%    6.73ms
100.000%    6.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.091     0.000000            1         1.00
       1.923     0.100000          391         1.11
       2.127     0.200000          780         1.25
       2.285     0.300000         1172         1.43
       2.437     0.400000         1563         1.67
       2.565     0.500000         1952         2.00
       2.635     0.550000         2157         2.22
       2.695     0.600000         2341         2.50
       2.771     0.650000         2539         2.86
       2.843     0.700000         2732         3.33
       2.925     0.750000         2927         4.00
       2.969     0.775000         3025         4.44
       3.015     0.800000         3121         5.00
       3.063     0.825000         3223         5.71
       3.105     0.850000         3318         6.67
       3.161     0.875000         3415         8.00
       3.191     0.887500         3465         8.89
       3.221     0.900000         3515        10.00
       3.245     0.912500         3560        11.43
       3.285     0.925000         3609        13.33
       3.329     0.937500         3657        16.00
       3.349     0.943750         3683        17.78
       3.387     0.950000         3705        20.00
       3.411     0.956250         3730        22.86
       3.451     0.962500         3757        26.67
       3.503     0.968750         3779        32.00
       3.529     0.971875         3791        35.56
       3.553     0.975000         3803        40.00
       3.585     0.978125         3816        45.71
       3.625     0.981250         3827        53.33
       3.687     0.984375         3840        64.00
       3.725     0.985938         3847        71.11
       3.759     0.987500         3852        80.00
       3.833     0.989062         3858        91.43
       3.867     0.990625         3864       106.67
       3.957     0.992188         3870       128.00
       4.079     0.992969         3873       142.22
       4.119     0.993750         3876       160.00
       4.611     0.994531         3879       182.86
       4.859     0.995313         3882       213.33
       5.231     0.996094         3885       256.00
       5.539     0.996484         3888       284.44
       5.539     0.996875         3888       320.00
       5.803     0.997266         3890       365.71
       5.983     0.997656         3891       426.67
       6.015     0.998047         3893       512.00
       6.043     0.998242         3894       568.89
       6.043     0.998437         3894       640.00
       6.175     0.998633         3895       731.43
       6.187     0.998828         3896       853.33
       6.323     0.999023         3897      1024.00
       6.323     0.999121         3897      1137.78
       6.323     0.999219         3897      1280.00
       6.495     0.999316         3898      1462.86
       6.495     0.999414         3898      1706.67
       6.651     0.999512         3899      2048.00
       6.651     0.999561         3899      2275.56
       6.651     0.999609         3899      2560.00
       6.651     0.999658         3899      2925.71
       6.651     0.999707         3899      3413.33
       6.727     0.999756         3900      4096.00
       6.727     1.000000         3900          inf
#[Mean    =        2.582, StdDeviation   =        0.546]
#[Max     =        6.724, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 524.33KB read
Requests/sec:    200.04
Transfer/sec:     17.48KB